PRAGMA foreign_keys = ON;

CREATE TABLE "八大行星" (
"词条id" int,
"名称" text,
"距日距离" int,
"表面积" int,
"体积排名" int,
"重量排名" int,
"最高温度" int,
"最低温度" int,
primary key ("词条id")
);

CREATE TABLE "行星相关电影" (
"词条id" int,
"影片名" text,
"导演" text,
"拍摄国家" text,
"豆瓣评分" int,
"关联行星id" int,
primary key ("词条id"),
foreign key("关联行星id") references "八大行星"("词条id")
);

CREATE TABLE "火星探测国家" (
"探测器" text,
"发射时间" time,
"国家" text,
"结果" text
);

CREATE TABLE "月球探测国家" (
"飞行器" text,
"时间" time,
"国家" text,
"有无航天员" binary,
"探测目的" text
);

CREATE TABLE "载人飞船" (
"飞船名称" text,
"发射时间" time,
"发射数量" int,
"国家" text,
"航天员数量" int,
"航天员出舱时间" int
);

insert into "八大行星" ("词条id", "名称", "距日距离", "表面积", "体积排名", "重量排名", "最高温度", "最低温度") values ("item_activity_6_41", "水星", "57910000千米", "7480万", "1", "1", "50", "负50摄氏度")

insert into "八大行星" ("词条id", "名称", "距日距离", "表面积", "体积排名", "重量排名", "最高温度", "最低温度") values ("item_activity_6_42", "金星", "108200000千米", "4亿6千万", "8", "8", "400摄氏度", "160摄氏度")

insert into "八大行星" ("词条id", "名称", "距日距离", "表面积", "体积排名", "重量排名", "最高温度", "最低温度") values ("item_activity_6_43", "地球", "149600000千米", "5.11亿", "1", "8", "50", "160摄氏度")

insert into "八大行星" ("词条id", "名称", "距日距离", "表面积", "体积排名", "重量排名", "最高温度", "最低温度") values ("item_activity_6_44", "火星", "227940000千米", "1亿4千万", "8", "8", "50", "负50摄氏度")

insert into "八大行星" ("词条id", "名称", "距日距离", "表面积", "体积排名", "重量排名", "最高温度", "最低温度") values ("item_activity_6_45", "木星", "778330000千米", "614.19亿", "1", "8", "50", "160摄氏度")

insert into "行星相关电影" ("词条id", "影片名", "导演", "拍摄国家", "豆瓣评分", "关联行星id") values ("item_activity_6_46", "星际穿越", "克里斯托弗·诺兰", "美国", "7.0", "item_activity_6_41")

insert into "行星相关电影" ("词条id", "影片名", "导演", "拍摄国家", "豆瓣评分", "关联行星id") values ("item_activity_6_47", "火星救援", "雷德利·斯科特", "加拿大", "8.5", "item_activity_6_42")

insert into "行星相关电影" ("词条id", "影片名", "导演", "拍摄国家", "豆瓣评分", "关联行星id") values ("item_activity_6_48", "太空救援", "克里姆·斯彭科", "俄罗斯", "8.5", "item_activity_6_45")

insert into "行星相关电影" ("词条id", "影片名", "导演", "拍摄国家", "豆瓣评分", "关联行星id") values ("item_activity_6_49", "太空旅客", "莫腾·泰杜姆", "美国", "7.0", "item_activity_6_44")

insert into "行星相关电影" ("词条id", "影片名", "导演", "拍摄国家", "豆瓣评分", "关联行星id") values ("item_activity_6_50", "天际行者", "尤里·贝科夫", "美国", "8.5", "item_activity_6_44")

insert into "火星探测国家" ("探测器", "发射时间", "国家", "结果") values ("火星18号", "1960年", "美国", "成功")

insert into "火星探测国家" ("探测器", "发射时间", "国家", "结果") values ("海盗1号", "2018年", "苏联", "失败")

insert into "火星探测国家" ("探测器", "发射时间", "国家", "结果") values ("海盗2号", "2018年", "俄罗斯", "失败")

insert into "火星探测国家" ("探测器", "发射时间", "国家", "结果") values ("火卫1号", "2018年", "日本", "成功")

insert into "火星探测国家" ("探测器", "发射时间", "国家", "结果") values ("火卫2号", "2018年", "欧空局", "成功")

insert into "月球探测国家" ("飞行器", "时间", "国家", "有无航天员", "探测目的") values ("月球1号", "1959年", "苏联", "无", "探测")

insert into "月球探测国家" ("飞行器", "时间", "国家", "有无航天员", "探测目的") values ("月球3号", "1959年", "苏联", "无", "探测")

insert into "月球探测国家" ("飞行器", "时间", "国家", "有无航天员", "探测目的") values ("阿波罗11号", "1969年", "美国", "有", "登陆")

insert into "月球探测国家" ("飞行器", "时间", "国家", "有无航天员", "探测目的") values ("嫦娥一号卫星", "2007年", "中国", "无", "探测")

insert into "月球探测国家" ("飞行器", "时间", "国家", "有无航天员", "探测目的") values ("嫦娥四号", "2018年", "中国", "无", "着陆月背")

insert into "载人飞船" ("飞船名称", "发射时间", "发射数量", "国家", "航天员数量", "航天员出舱时间") values ("俄罗斯东方号", "1961年", "6", "俄罗斯", "1", "3分")

insert into "载人飞船" ("飞船名称", "发射时间", "发射数量", "国家", "航天员数量", "航天员出舱时间") values ("俄罗斯上升号", "1964年", "2", "美国", "3人", "10分")

insert into "载人飞船" ("飞船名称", "发射时间", "发射数量", "国家", "航天员数量", "航天员出舱时间") values ("美国水星号", "1961年", "6", "中国", "3人", "10分")

insert into "载人飞船" ("飞船名称", "发射时间", "发射数量", "国家", "航天员数量", "航天员出舱时间") values ("美国双子座星号", "1965年", "12", "中国", "3人", "3分")

insert into "载人飞船" ("飞船名称", "发射时间", "发射数量", "国家", "航天员数量", "航天员出舱时间") values ("美国阿波罗号", "1968年", "12", "美国", "1", "3分")

