PRAGMA foreign_keys = ON;

CREATE TABLE "中国各城市马拉松" (
"词条id" int,
"名称" text,
"举办城市" text,
"省份" text,
"时间" time,
"全程赛道" int,
"人数规模" int,
primary key ("词条id")
);

CREATE TABLE "马拉松赛程" (
"马拉松id" int,
"赛程" text,
"公里数" int,
"报名人数" int,
"中签率" int,
foreign key("马拉松id") references "中国各城市马拉松"("词条id")
);

CREATE TABLE "历届马拉松纪录" (
"年份" time,
"城市" text,
"参赛者最小年龄" int,
"参赛者最大年龄" int,
"全程最少时间" int
);

insert into "中国各城市马拉松" ("词条id", "名称", "举办城市", "省份", "时间", "全程赛道", "人数规模") values ("item_sports.2_14_126", "2019年北京马拉松", "北京", "北京", "9.5", "40", "10000")

insert into "中国各城市马拉松" ("词条id", "名称", "举办城市", "省份", "时间", "全程赛道", "人数规模") values ("item_sports.2_14_127", "2019年哈尔滨马拉松", "哈尔滨", "黑龙江", "11.20", "50公里", "30000")

insert into "中国各城市马拉松" ("词条id", "名称", "举办城市", "省份", "时间", "全程赛道", "人数规模") values ("item_sports.2_14_128", "2019年大连马拉松", "大连", "辽宁", "11.20", "50公里", "10000")

insert into "中国各城市马拉松" ("词条id", "名称", "举办城市", "省份", "时间", "全程赛道", "人数规模") values ("item_sports.2_14_129", "2019年郑州马拉松", "郑州", "河南", "11.20", "40", "10000")

insert into "中国各城市马拉松" ("词条id", "名称", "举办城市", "省份", "时间", "全程赛道", "人数规模") values ("item_sports.2_14_130", "2019年深圳马拉松", "深圳", "广东", "11.20", "50公里", "30000")

insert into "马拉松赛程" ("马拉松id", "赛程", "公里数", "报名人数", "中签率") values ("item_sports.2_14_128", "全程", "42", "2000", "20%")

insert into "马拉松赛程" ("马拉松id", "赛程", "公里数", "报名人数", "中签率") values ("item_sports.2_14_130", "半程", " 20", "15000", "45%")

insert into "马拉松赛程" ("马拉松id", "赛程", "公里数", "报名人数", "中签率") values ("item_sports.2_14_130", "迷你", " 5", "2000", "45%")

insert into "马拉松赛程" ("马拉松id", "赛程", "公里数", "报名人数", "中签率") values ("item_sports.2_14_128", "迷你", "42", "2000", "45%")

insert into "马拉松赛程" ("马拉松id", "赛程", "公里数", "报名人数", "中签率") values ("item_sports.2_14_126", "半程", " 20", "2000", "20%")

insert into "历届马拉松纪录" ("年份", "城市", "参赛者最小年龄", "参赛者最大年龄", "全程最少时间") values ("2019", "山西省", "19", "55", "3h")

insert into "历届马拉松纪录" ("年份", "城市", "参赛者最小年龄", "参赛者最大年龄", "全程最少时间") values ("2019", "郑州市", "18", "56", "4h")

insert into "历届马拉松纪录" ("年份", "城市", "参赛者最小年龄", "参赛者最大年龄", "全程最少时间") values ("2019", "陕西省", "20", "58", "2h")

insert into "历届马拉松纪录" ("年份", "城市", "参赛者最小年龄", "参赛者最大年龄", "全程最少时间") values ("2019", "湖南省", "21", "59", "3.5h")

insert into "历届马拉松纪录" ("年份", "城市", "参赛者最小年龄", "参赛者最大年龄", "全程最少时间") values ("2019", "四川省", "22", "60", "5h")

