PRAGMA foreign_keys = ON;

CREATE TABLE "各国假期" (
"国家" text,
"假期总天数" int,
"带薪年假" int,
"公共假期" int,
"排名" int
);

CREATE TABLE "各国产假" (
"国家" text,
"产假总天数" int,
"工资比例" int
);

CREATE TABLE "各国税率" (
"国家" text,
"年总税率" int,
"个税最高税率" int,
"社保费率" int,
"企业所得税税率" int
);

CREATE TABLE "各国医疗支出占比" (
"国家" text,
"医疗支出占GDP比重" int
);

insert into "各国假期" ("国家", "假期总天数", "带薪年假", "公共假期", "排名") values ("墨西哥", "14", "6", "8", "40")

insert into "各国假期" ("国家", "假期总天数", "带薪年假", "公共假期", "排名") values ("中国", "16", "5", "11", "39")

insert into "各国假期" ("国家", "假期总天数", "带薪年假", "公共假期", "排名") values ("加拿大", "19", "10", "9", "38")

insert into "各国假期" ("国家", "假期总天数", "带薪年假", "公共假期", "排名") values ("日本", "25", "10", "15", "35")

insert into "各国假期" ("国家", "假期总天数", "带薪年假", "公共假期", "排名") values ("德国", "29", "20", "9", "29")

insert into "各国产假" ("国家", "产假总天数", "工资比例") values ("瑞典", "480", "77.6%")

insert into "各国产假" ("国家", "产假总天数", "工资比例") values ("挪威", "300", "100%")

insert into "各国产假" ("国家", "产假总天数", "工资比例") values ("英国", "365", "10%")

insert into "各国产假" ("国家", "产假总天数", "工资比例") values ("法国", "140", "100%")

insert into "各国产假" ("国家", "产假总天数", "工资比例") values ("德国", "300", "67%")

insert into "各国税率" ("国家", "年总税率", "个税最高税率", "社保费率", "企业所得税税率") values ("瑞典", "63%", "51%", "0", "20%")

insert into "各国税率" ("国家", "年总税率", "个税最高税率", "社保费率", "企业所得税税率") values ("丹麦", "83%", "57%", "31%", "30%")

insert into "各国税率" ("国家", "年总税率", "个税最高税率", "社保费率", "企业所得税税率") values ("荷兰", "63%", "51%", "31%", "30%")

insert into "各国税率" ("国家", "年总税率", "个税最高税率", "社保费率", "企业所得税税率") values ("西班牙", "83%", "51%", "31%", "30%")

insert into "各国税率" ("国家", "年总税率", "个税最高税率", "社保费率", "企业所得税税率") values ("芬兰", "63%", "57%", "31%", "20%")

insert into "各国医疗支出占比" ("国家", "医疗支出占GDP比重") values ("瑞典", "4%")

insert into "各国医疗支出占比" ("国家", "医疗支出占GDP比重") values ("丹麦", "10%")

insert into "各国医疗支出占比" ("国家", "医疗支出占GDP比重") values ("荷兰", "10%")

insert into "各国医疗支出占比" ("国家", "医疗支出占GDP比重") values ("西班牙", "10%")

insert into "各国医疗支出占比" ("国家", "医疗支出占GDP比重") values ("芬兰", "10%")

