PRAGMA foreign_keys = ON;

CREATE TABLE "基金公司" (
"词条id" int,
"名称" text,
"注册资本" int,
"封闭式基金数量" int,
"开放式基金数量" int,
"亚洲债券基金数量" int,
"基金数量排名" int,
"基金品种数排名" int,
primary key ("词条id")
);

CREATE TABLE "基金公司的股东公司" (
"公司id" int,
"股东公司" text,
"出资比例" int,
foreign key("公司id") references "基金公司"("词条id")
);

CREATE TABLE "基金公司收入" (
"年份" time,
"公司id" int,
"资产规模" int,
"利润合计" int,
"管理费合计" int,
foreign key("公司id") references "基金公司"("词条id")
);

insert into "基金公司" ("词条id", "名称", "注册资本", "封闭式基金数量", "开放式基金数量", "亚洲债券基金数量", "基金数量排名", "基金品种数排名") values ("item_mechanism_6_61", "华夏基金", "10000万", "2", "11", "1", "1", "1")

insert into "基金公司" ("词条id", "名称", "注册资本", "封闭式基金数量", "开放式基金数量", "亚洲债券基金数量", "基金数量排名", "基金品种数排名") values ("item_mechanism_6_62", "易方达基金", "15000万", "3", "13", "2", "4", "6")

insert into "基金公司" ("词条id", "名称", "注册资本", "封闭式基金数量", "开放式基金数量", "亚洲债券基金数量", "基金数量排名", "基金品种数排名") values ("item_mechanism_6_63", "南方基金", "20000万", "4", "14", "1", "5", "7")

insert into "基金公司" ("词条id", "名称", "注册资本", "封闭式基金数量", "开放式基金数量", "亚洲债券基金数量", "基金数量排名", "基金品种数排名") values ("item_mechanism_6_64", "博时基金", "21000万", "3", "15", "3", "6", "8")

insert into "基金公司" ("词条id", "名称", "注册资本", "封闭式基金数量", "开放式基金数量", "亚洲债券基金数量", "基金数量排名", "基金品种数排名") values ("item_mechanism_6_65", "广发基金", "23800万", "5", "18", "3", "10", "10")

insert into "基金公司的股东公司" ("公司id", "股东公司", "出资比例") values ("item_mechanism_6_63", "中信证券股份有限公司", "10%")

insert into "基金公司的股东公司" ("公司id", "股东公司", "出资比例") values ("item_mechanism_6_61", "南方工业资产管理有限责任公司", "20%")

insert into "基金公司的股东公司" ("公司id", "股东公司", "出资比例") values ("item_mechanism_6_65", "山东省农村经济开发投资公司", "35%")

insert into "基金公司的股东公司" ("公司id", "股东公司", "出资比例") values ("item_mechanism_6_65", "山东海丰国际航运集团有限公司", "405")

insert into "基金公司的股东公司" ("公司id", "股东公司", "出资比例") values ("item_mechanism_6_65", "无锡市国联发展(集团", "49%")

insert into "基金公司收入" ("年份", "公司id", "资产规模", "利润合计", "管理费合计") values ("2015", "item_mechanism_6_61", "1000亿", "100亿", "500亿")

insert into "基金公司收入" ("年份", "公司id", "资产规模", "利润合计", "管理费合计") values ("2016", "item_mechanism_6_64", "1500亿", "200亿", "600亿")

insert into "基金公司收入" ("年份", "公司id", "资产规模", "利润合计", "管理费合计") values ("2017", "item_mechanism_6_65", "3000亿", "500亿", "1000亿")

insert into "基金公司收入" ("年份", "公司id", "资产规模", "利润合计", "管理费合计") values ("2014", "item_mechanism_6_65", "2500亿", "700亿", "1500亿")

insert into "基金公司收入" ("年份", "公司id", "资产规模", "利润合计", "管理费合计") values ("2018", "item_mechanism_6_65", "3100亿", "1200亿", "2000亿")

