PRAGMA foreign_keys = ON;

CREATE TABLE "夏季奥运会" (
"届数" int,
"奥运会" text,
"举办国家" text,
"举办城市" text,
"口号" text
);

CREATE TABLE "冬季奥运会" (
"届数" int,
"奥运会" text,
"举办国家" text,
"举办城市" text
);

CREATE TABLE "奥运会申办国家" (
"届数" int,
"奥运会" text,
"申办国家" text,
"申办城市" text,
"是否成功" binary
);

insert into "夏季奥运会" ("届数", "奥运会", "举办国家", "举办城市", "口号") values ("1", "1896年雅典奥运会", "希腊", "雅典", "参与历史")

insert into "夏季奥运会" ("届数", "奥运会", "举办国家", "举办城市", "口号") values ("2", "1900年巴黎奥运会", "法国", "巴黎", "永远的朋友")

insert into "夏季奥运会" ("届数", "奥运会", "举办国家", "举办城市", "口号") values ("3", "1904年圣路易斯奥运会", "美国", "圣路易斯", "分享奥林匹克精神")

insert into "夏季奥运会" ("届数", "奥运会", "举办国家", "举办城市", "口号") values ("4", "1908年伦敦奥运会", "英国", "伦敦", "同一个世界同一个梦想")

insert into "夏季奥运会" ("届数", "奥运会", "举办国家", "举办城市", "口号") values ("5", "1912年斯德哥尔摩奥运会", "瑞典", "斯德哥尔摩", "欢迎回家")

insert into "冬季奥运会" ("届数", "奥运会", "举办国家", "举办城市") values ("19", "2002年盐湖城", "美国", "盐湖城")

insert into "冬季奥运会" ("届数", "奥运会", "举办国家", "举办城市") values ("20", "2006年都灵", "意大利", "都灵")

insert into "冬季奥运会" ("届数", "奥运会", "举办国家", "举办城市") values ("21", "2010年温哥华", "加拿大", "温哥华")

insert into "冬季奥运会" ("届数", "奥运会", "举办国家", "举办城市") values ("22", "2014年索契", "俄罗斯", "索契")

insert into "冬季奥运会" ("届数", "奥运会", "举办国家", "举办城市") values ("23", "2018年平昌+冬季奥运会", "韩国", "平昌")

insert into "奥运会申办国家" ("届数", "奥运会", "申办国家", "申办城市", "是否成功") values ("27", "2000年悉尼", "中国", "东京", "是")

insert into "奥运会申办国家" ("届数", "奥运会", "申办国家", "申办城市", "是否成功") values ("28", "2004年雅典", "日本", "日本", "是")

insert into "奥运会申办国家" ("届数", "奥运会", "申办国家", "申办城市", "是否成功") values ("29", "2008年北京", "韩国", "巴黎", "是")

insert into "奥运会申办国家" ("届数", "奥运会", "申办国家", "申办城市", "是否成功") values ("30", "2012年伦敦", "西班牙", "洛杉矶", "是")

insert into "奥运会申办国家" ("届数", "奥运会", "申办国家", "申办城市", "是否成功") values ("31", "2016年里约热内卢+奥运会", "意大利", "亚特兰大", "是")

