PRAGMA foreign_keys = ON;

CREATE TABLE "卫视电视剧" (
"卫视" text,
"电视剧名" text,
"日期" time,
"播放时间" time,
"集数" int
);

CREATE TABLE "卫视综艺节目" (
"卫视" text,
"节目名" text,
"日期" time,
"播放时间" time,
"期数" int
);

CREATE TABLE "央视栏目" (
"频道" text,
"栏目名" text,
"类型" text,
"日期" time,
"播放时间" time
);

CREATE TABLE "付费栏目" (
"频道" text,
"栏目名" text,
"类型" text,
"日期" time,
"播放时间" time,
"费用" int
);

insert into "卫视电视剧" ("卫视", "电视剧名", "日期", "播放时间", "集数") values ("重庆卫视", "爱国者", "周一", "1:00", "21")

insert into "卫视电视剧" ("卫视", "电视剧名", "日期", "播放时间", "集数") values ("东南卫视", "游击英雄", "周三", "2:00", "22")

insert into "卫视电视剧" ("卫视", "电视剧名", "日期", "播放时间", "集数") values ("厦门卫视", "阿优之兔", "周四", "3:30", "23")

insert into "卫视电视剧" ("卫视", "电视剧名", "日期", "播放时间", "集数") values ("甘肃卫视", "飞哥大英雄", "周五", "4:00", "24")

insert into "卫视电视剧" ("卫视", "电视剧名", "日期", "播放时间", "集数") values ("甘肃卫视", "生死归途", "周日", "23:00", "25")

insert into "卫视综艺节目" ("卫视", "节目名", "日期", "播放时间", "期数") values ("安徽卫视", "一起来跳舞", "周一", "10:00", "第2")

insert into "卫视综艺节目" ("卫视", "节目名", "日期", "播放时间", "期数") values ("北京卫视", "跨界歌王", "周日", "22:00", "10期")

insert into "卫视综艺节目" ("卫视", "节目名", "日期", "播放时间", "期数") values ("深圳卫视", "周六问爸爸", "周一", "22:00", "10期")

insert into "卫视综艺节目" ("卫视", "节目名", "日期", "播放时间", "期数") values ("湖南卫视", "快乐大本营", "周一", "10:00", "10期")

insert into "卫视综艺节目" ("卫视", "节目名", "日期", "播放时间", "期数") values ("江苏卫视", "非诚勿扰", "周日", "10:00", "第2")

insert into "央视栏目" ("频道", "栏目名", "类型", "日期", "播放时间") values ("CCTV1综合", "2019主持人大赛", "电视剧", "周一", "1:00")

insert into "央视栏目" ("频道", "栏目名", "类型", "日期", "播放时间") values ("CCTV2财经", "经济信息联播", "电影", "周二", "1:30")

insert into "央视栏目" ("频道", "栏目名", "类型", "日期", "播放时间") values ("CCTV3综艺", "直通春晚", "综艺节目", "周四", "2:00")

insert into "央视栏目" ("频道", "栏目名", "类型", "日期", "播放时间") values ("CCTV5体育", "2019-2020赛季短道速滑世界杯录播", "音乐", "周五", "2:30")

insert into "央视栏目" ("频道", "栏目名", "类型", "日期", "播放时间") values ("CCTV6电影", "唐人街探案", "新闻", "周日", "23:00")

insert into "付费栏目" ("频道", "栏目名", "类型", "日期", "播放时间", "费用") values ("风云足球", "摩纳哥-巴黎圣日尔曼", "电视剧", "周一", "1:00", "3元")

insert into "付费栏目" ("频道", "栏目名", "类型", "日期", "播放时间", "费用") values ("第一剧场", "小丈夫", "电影", "周二", "2:00", "4元")

insert into "付费栏目" ("频道", "栏目名", "类型", "日期", "播放时间", "费用") values ("风云剧场", "左右亲情右手爱", "综艺节目", "周三", "3:00", "10元")

insert into "付费栏目" ("频道", "栏目名", "类型", "日期", "播放时间", "费用") values ("世界地理", "超级玩家的崛起", "音乐会", "周四", "4:00", "15元")

insert into "付费栏目" ("频道", "栏目名", "类型", "日期", "播放时间", "费用") values ("怀旧剧场", "妻子的秘密", "体育比赛", "周六", "5:00", "19元")

