PRAGMA foreign_keys = ON;

CREATE TABLE "世博会" (
"词条id" int,
"名称" text,
"时间" time,
"地点" text,
"种类" text,
"举办天数" int,
"主题" text,
"参展方数量" int,
"投资成本" int,
"会场面积" int,
"参观人数" int,
"单日客流" int,
primary key ("词条id")
);

CREATE TABLE "世博会场馆" (
"世博会id" int,
"场馆" text,
"场馆所属国家" text,
"排名" int,
"占比面积" int,
"参观人数" int,
foreign key("世博会id") references "世博会"("词条id")
);

CREATE TABLE "世界园博会" (
"词条id" int,
"名称" text,
"时间" time,
"地点" text,
"级别" text,
"会期" int,
"主题" text,
"场馆数量" int,
"会场面积" int,
"参观人数" int,
"票价" int,
primary key ("词条id")
);

CREATE TABLE "中国花卉园博会" (
"时间" time,
"届数" int,
"举办城市" text,
"地点" text,
"展园数量" int,
"参与机构数量" int
);

insert into "世博会" ("词条id", "名称", "时间", "地点", "种类", "举办天数", "主题", "参展方数量", "投资成本", "会场面积", "参观人数", "单日客流") values ("item_activity_4_16", "中国2010年上海世界博览会", "2000年", "中国上海", "综合", "184", "城市让生活更美好", "100", "200亿", "3万平方公里", "800万", "50万")

insert into "世博会" ("词条id", "名称", "时间", "地点", "种类", "举办天数", "主题", "参展方数量", "投资成本", "会场面积", "参观人数", "单日客流") values ("item_activity_4_17", "2008年萨拉戈萨世博会", "2012年", "西班牙萨拉戈萨", "专业", "93", "水与可持续发展", "240", "450亿", "5.28万平方公里", "7307万", "103万")

insert into "世博会" ("词条id", "名称", "时间", "地点", "种类", "举办天数", "主题", "参展方数量", "投资成本", "会场面积", "参观人数", "单日客流") values ("item_activity_4_18", "2005年日本国际博览会", "2000年", "日本爱知", "综合", "185", "自然的睿智", "240", "200亿", "5.28万平方公里", "800万", "50万")

insert into "世博会" ("词条id", "名称", "时间", "地点", "种类", "举办天数", "主题", "参展方数量", "投资成本", "会场面积", "参观人数", "单日客流") values ("item_activity_4_19", "2000年汉诺威世界博览会", "2000年", "德国汉诺威", "综合", "153", "人类", "100", "200亿", "3万平方公里", "7307万", "103万")

insert into "世博会" ("词条id", "名称", "时间", "地点", "种类", "举办天数", "主题", "参展方数量", "投资成本", "会场面积", "参观人数", "单日客流") values ("item_activity_4_20", "2012年韩国丽水海洋世博会", "2012年", "韩国丽水", "综合", "93天", "天然的海洋", "240", "450亿", "3万平方公里", "7307万", "50万")

insert into "世博会场馆" ("世博会id", "场馆", "场馆所属国家", "排名", "占比面积", "参观人数") values ("item_activity_4_19", "中国馆", "中国", "1", "1000", "1万")

insert into "世博会场馆" ("世博会id", "场馆", "场馆所属国家", "排名", "占比面积", "参观人数") values ("item_activity_4_17", "瑞士馆", "瑞士", "20", "5000平方米", "100万")

insert into "世博会场馆" ("世博会id", "场馆", "场馆所属国家", "排名", "占比面积", "参观人数") values ("item_activity_4_19", "法国馆", "法国", "1", "1000", "1万")

insert into "世博会场馆" ("世博会id", "场馆", "场馆所属国家", "排名", "占比面积", "参观人数") values ("item_activity_4_19", "德国馆", "德国", "1", "1000", "1万")

insert into "世博会场馆" ("世博会id", "场馆", "场馆所属国家", "排名", "占比面积", "参观人数") values ("item_activity_4_20", "意大利馆", "意大利", "1", "1000", "1万")

insert into "世界园博会" ("词条id", "名称", "时间", "地点", "级别", "会期", "主题", "场馆数量", "会场面积", "参观人数", "票价") values ("item_activity_4_21", "芬洛世界园艺博览会", "2012年", "荷兰芬洛", "A1类", "120天", "共谋绿色生活", "48", "120公顷", "400万", "120元")

insert into "世界园博会" ("词条id", "名称", "时间", "地点", "级别", "会期", "主题", "场馆数量", "会场面积", "参观人数", "票价") values ("item_activity_4_22", "顺天湾国际园艺博览会", "2013年", " 韩国顺天", "A2+B1类", "240天", "共建美丽家园", "20", "260公顷", "1600万", "160元")

insert into "世界园博会" ("词条id", "名称", "时间", "地点", "级别", "会期", "主题", "场馆数量", "会场面积", "参观人数", "票价") values ("item_activity_4_23", "青岛世界园艺博览会", "2014年", " 中国青岛", "A1类", "120天", "让生活走进自然", "48", "260公顷", "1600万", "160元")

insert into "世界园博会" ("词条id", "名称", "时间", "地点", "级别", "会期", "主题", "场馆数量", "会场面积", "参观人数", "票价") values ("item_activity_4_24", "安塔利亚世界园艺博览会", "2016年", "土耳其安塔利亚", "A2+B1类", "120天", "彩花流水新视界", "48", "260公顷", "1600万", "160元")

insert into "世界园博会" ("词条id", "名称", "时间", "地点", "级别", "会期", "主题", "场馆数量", "会场面积", "参观人数", "票价") values ("item_activity_4_25", "北京世界园艺博览会", "2019年", "中国北京 ", "A1类", "240天", "城市与海和谐未来", "48", "260公顷", "1600万", "120元")

insert into "中国花卉园博会" ("时间", "届数", "举办城市", "地点", "展园数量", "参与机构数量") values ("2009", "第七届", "济南", "济南国际园林花卉博览园", "100", "120")

insert into "中国花卉园博会" ("时间", "届数", "举办城市", "地点", "展园数量", "参与机构数量") values ("2011", "第八届", "重庆", "重庆园博园", "110", "125")

insert into "中国花卉园博会" ("时间", "届数", "举办城市", "地点", "展园数量", "参与机构数量") values ("2013", "第九届", "北京丰台", "北京永定河畔", "115", "130")

insert into "中国花卉园博会" ("时间", "届数", "举办城市", "地点", "展园数量", "参与机构数量") values ("2015", "第10届", "武汉", "金银湖", "120", "140")

insert into "中国花卉园博会" ("时间", "届数", "举办城市", "地点", "展园数量", "参与机构数量") values ("2017", "第十一届", "郑州", "郑州航空港经济综合实验区", "120", "150")

