PRAGMA foreign_keys = ON;

CREATE TABLE "滴滴打车出行" (
"季节" text,
"是否工作日" binary,
"温度" int,
"湿度" int,
"风速" int,
"日订单数量" int,
"人均打车次数" int,
"平均等待时间" int
);

CREATE TABLE "共享单车出行" (
"季节" text,
"是否工作日" binary,
"温度" int,
"湿度" int,
"风速" int,
"人均骑车次数" int,
"人均骑车距离" int
);

insert into "滴滴打车出行" ("季节", "是否工作日", "温度", "湿度", "风速", "日订单数量", "人均打车次数", "平均等待时间") values ("春", "是", "-10", "10%", "0", "10万", "0.01", "3分")

insert into "滴滴打车出行" ("季节", "是否工作日", "温度", "湿度", "风速", "日订单数量", "人均打车次数", "平均等待时间") values ("夏", "否", "30度", "80%", "7级", "100万", "0.9", "50分")

insert into "滴滴打车出行" ("季节", "是否工作日", "温度", "湿度", "风速", "日订单数量", "人均打车次数", "平均等待时间") values ("秋", "否", "-10", "10%", "7级", "10万", "0.01", "50分")

insert into "滴滴打车出行" ("季节", "是否工作日", "温度", "湿度", "风速", "日订单数量", "人均打车次数", "平均等待时间") values ("冬", "否", "-10", "10%", "7级", "100万", "0.9", "3分")

insert into "滴滴打车出行" ("季节", "是否工作日", "温度", "湿度", "风速", "日订单数量", "人均打车次数", "平均等待时间") values ("秋", "是", "-10", "10%", "0", "100万", "0.9", "50分")

insert into "共享单车出行" ("季节", "是否工作日", "温度", "湿度", "风速", "人均骑车次数", "人均骑车距离") values ("春", "是", "-10", "10%", "0", "0.01", "500米")

insert into "共享单车出行" ("季节", "是否工作日", "温度", "湿度", "风速", "人均骑车次数", "人均骑车距离") values ("夏", "否", "30度", "80%", "7级", "0.9", "3千米")

insert into "共享单车出行" ("季节", "是否工作日", "温度", "湿度", "风速", "人均骑车次数", "人均骑车距离") values ("秋", "否", "30度", "80%", "0", "0.01", "500米")

insert into "共享单车出行" ("季节", "是否工作日", "温度", "湿度", "风速", "人均骑车次数", "人均骑车距离") values ("冬", "否", "30度", "80%", "7级", "0.01", "500米")

insert into "共享单车出行" ("季节", "是否工作日", "温度", "湿度", "风速", "人均骑车次数", "人均骑车距离") values ("春", "否", "30度", "80%", "0", "0.9", "500米")

