PRAGMA foreign_keys = ON;

CREATE TABLE "40城消费力排名" (
"城市" text,
"所在省份" text,
"社消总额(亿)" int,
"总额排名" int,
"增速" int,
"增速排名" int,
"人均社消(万)" int,
"总GDP(亿)" int,
"人均GDP(万)" int,
"常住人口(万)" int,
"参考房价" int
);

CREATE TABLE "各城市消费结构" (
"城市" text,
"人均可支配收入" int,
"餐饮消费占比" int,
"奢侈品消费占比" int,
"旅游占比" int,
"人均网购消费额" int,
"电子产品消费占比" int
);

CREATE TABLE "生态文明消费" (
"环保消费品" text,
"增长率" int
);

CREATE TABLE "品牌消费" (
"品牌" text,
"类型" text,
"销量占比" int,
"销量排名" int
);

CREATE TABLE "商品种类消费增速" (
"种类" text,
"2013年增速" int,
"2015年增速" int,
"2017年增速" int
);

insert into "40城消费力排名" ("城市", "所在省份", "社消总额(亿)", "总额排名", "增速", "增速排名", "人均社消(万)", "总GDP(亿)", "人均GDP(万)", "常住人口(万)", "参考房价") values ("上海", "上海", "", "1", "2.7", "1", "", "", "", "", "49480")

insert into "40城消费力排名" ("城市", "所在省份", "社消总额(亿)", "总额排名", "增速", "增速排名", "人均社消(万)", "总GDP(亿)", "人均GDP(万)", "常住人口(万)", "参考房价") values ("北京", "北京", "", "40", "10.5%", "40", "", "", "", "", "11827")

insert into "40城消费力排名" ("城市", "所在省份", "社消总额(亿)", "总额排名", "增速", "增速排名", "人均社消(万)", "总GDP(亿)", "人均GDP(万)", "常住人口(万)", "参考房价") values ("广州", "广东", "", "1", "2.7", "40", "", "", "", "", "11827")

insert into "40城消费力排名" ("城市", "所在省份", "社消总额(亿)", "总额排名", "增速", "增速排名", "人均社消(万)", "总GDP(亿)", "人均GDP(万)", "常住人口(万)", "参考房价") values ("重庆", "重庆", "", "1", "2.7", "40", "", "", "", "", "49480")

insert into "40城消费力排名" ("城市", "所在省份", "社消总额(亿)", "总额排名", "增速", "增速排名", "人均社消(万)", "总GDP(亿)", "人均GDP(万)", "常住人口(万)", "参考房价") values ("武汉", "湖北", "", "1", "2.7", "40", "", "", "", "", "49480")

insert into "各城市消费结构" ("城市", "人均可支配收入", "餐饮消费占比", "奢侈品消费占比", "旅游占比", "人均网购消费额", "电子产品消费占比") values ("上海", "5000", "20%", "10", "10%", "1000", "5")

insert into "各城市消费结构" ("城市", "人均可支配收入", "餐饮消费占比", "奢侈品消费占比", "旅游占比", "人均网购消费额", "电子产品消费占比") values ("北京", "20000", "60%", "30%", "40%", "10000", "30%")

insert into "各城市消费结构" ("城市", "人均可支配收入", "餐饮消费占比", "奢侈品消费占比", "旅游占比", "人均网购消费额", "电子产品消费占比") values ("广州", "20000", "60%", "30%", "10%", "1000", "5")

insert into "各城市消费结构" ("城市", "人均可支配收入", "餐饮消费占比", "奢侈品消费占比", "旅游占比", "人均网购消费额", "电子产品消费占比") values ("重庆", "5000", "60%", "10", "10%", "1000", "30%")

insert into "各城市消费结构" ("城市", "人均可支配收入", "餐饮消费占比", "奢侈品消费占比", "旅游占比", "人均网购消费额", "电子产品消费占比") values ("武汉", "20000", "20%", "10", "40%", "1000", "30%")

insert into "生态文明消费" ("环保消费品", "增长率") values ("绿色家具", "47%")

insert into "生态文明消费" ("环保消费品", "增长率") values ("绿色食品", "83%")

insert into "生态文明消费" ("环保消费品", "增长率") values ("绿色家电", "83%")

insert into "生态文明消费" ("环保消费品", "增长率") values ("绿色服装", "47%")

insert into "生态文明消费" ("环保消费品", "增长率") values ("绿色护理用品", "47%")

insert into "品牌消费" ("品牌", "类型", "销量占比", "销量排名") values ("苹果", "手机", "20%", "1")

insert into "品牌消费" ("品牌", "类型", "销量占比", "销量排名") values ("华为", "服装", "50%", "7")

insert into "品牌消费" ("品牌", "类型", "销量占比", "销量排名") values ("小米", "手机", "50%", "7")

insert into "品牌消费" ("品牌", "类型", "销量占比", "销量排名") values ("花花公子", "手机", "20%", "7")

insert into "品牌消费" ("品牌", "类型", "销量占比", "销量排名") values ("南极人", "手机", "20%", "1")

insert into "商品种类消费增速" ("种类", "2013年增速", "2015年增速", "2017年增速") values ("日用品", "9.9", "-6.6%", "2.8")

insert into "商品种类消费增速" ("种类", "2013年增速", "2015年增速", "2017年增速") values ("读书用品", "25.8%", "29.3", "15.6%")

insert into "商品种类消费增速" ("种类", "2013年增速", "2015年增速", "2017年增速") values ("娱乐用品", "25.8%", "29.3", "2.8")

insert into "商品种类消费增速" ("种类", "2013年增速", "2015年增速", "2017年增速") values ("化妆品", "25.8%", "-6.6%", "15.6%")

insert into "商品种类消费增速" ("种类", "2013年增速", "2015年增速", "2017年增速") values ("粮油食品", "9.9", "29.3", "15.6%")

