PRAGMA foreign_keys = ON;

CREATE TABLE "城市温度" (
"城市" text,
"夏季平均温度" int,
"冬季平均温度" int,
"年平均温度" int
);

CREATE TABLE "各城市极端高温" (
"城市" text,
"极端高温" int,
"出现日期" time
);

CREATE TABLE "各城市极端低温" (
"城市" text,
"极端低温" int,
"出现日期" time
);

CREATE TABLE "各城市各月平均气温" (
"城市" text,
"一月" int,
"二月" int,
"三月" int,
"四月" int,
"五月" int,
"六月" int,
"七月" int,
"八月" int,
"九月" int,
"十月" int,
"十一月" int,
"十二月" int
);

CREATE TABLE "各城市各月平均降水量mm" (
"城市" text,
"一月" int,
"二月" int,
"三月" int,
"四月" int,
"五月" int,
"六月" int,
"七月" int,
"八月" int,
"九月" int,
"十月" int,
"十一月" int,
"十二月" int
);

insert into "城市温度" ("城市", "夏季平均温度", "冬季平均温度", "年平均温度") values ("北京", "26.1", "-4.6", "11.8")

insert into "城市温度" ("城市", "夏季平均温度", "冬季平均温度", "年平均温度") values ("天津", " 25.2", "-4.2", "12.2")

insert into "城市温度" ("城市", "夏季平均温度", "冬季平均温度", "年平均温度") values ("石家庄", " 27.4", "-2", "13.3")

insert into "城市温度" ("城市", "夏季平均温度", "冬季平均温度", "年平均温度") values ("南京", "27.7", "-2.7", "15.6")

insert into "城市温度" ("城市", "夏季平均温度", "冬季平均温度", "年平均温度") values ("哈尔滨", "24.3", "-17.2", "4.4")

insert into "各城市极端高温" ("城市", "极端高温", "出现日期") values ("呼和浩特", "36.6", "1997.7.15")

insert into "各城市极端高温" ("城市", "极端高温", "出现日期") values ("大连", "41.9", "2010.7.30")

insert into "各城市极端高温" ("城市", "极端高温", "出现日期") values ("沈阳", "41.9", "2010.7.30")

insert into "各城市极端高温" ("城市", "极端高温", "出现日期") values ("长春", "41.9", "2010.7.30")

insert into "各城市极端高温" ("城市", "极端高温", "出现日期") values ("太原", "41.9", "1997.7.15")

insert into "各城市极端低温" ("城市", "极端低温", "出现日期") values ("哈尔滨", "-36.5", "1987.1.4")

insert into "各城市极端低温" ("城市", "极端低温", "出现日期") values ("齐齐哈尔", "-41.4", "2009.1.10")

insert into "各城市极端低温" ("城市", "极端低温", "出现日期") values ("长春", "-41.4", "2009.1.10")

insert into "各城市极端低温" ("城市", "极端低温", "出现日期") values ("吉林", "-36.5", "2009.1.10")

insert into "各城市极端低温" ("城市", "极端低温", "出现日期") values ("大连", "-36.5", "2009.1.10")

insert into "各城市各月平均气温" ("城市", "一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月") values ("上海", "2.0", "2.0", "2.0", "2.0", "28.0", "28.0", "28.0", "28.0", "28.0", "12.1", "12.1", "12.1")

insert into "各城市各月平均气温" ("城市", "一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月") values ("南京", "5.0", "5.0", "5.0", "5.0", "29.0", "29.0", "29.0", "29.0", "29.0", "17.1", "17.1", "17.1")

insert into "各城市各月平均气温" ("城市", "一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月") values ("杭州", "5.0", "5.0", "2.0", "5.0", "28.0", "29.0", "29.0", "28.0", "29.0", "12.1", "12.1", "12.1")

insert into "各城市各月平均气温" ("城市", "一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月") values ("合肥", "2.0", "5.0", "2.0", "2.0", "28.0", "29.0", "28.0", "29.0", "29.0", "17.1", "12.1", "12.1")

insert into "各城市各月平均气温" ("城市", "一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月") values ("福州", "2.0", "2.0", "2.0", "5.0", "29.0", "28.0", "28.0", "28.0", "28.0", "12.1", "12.1", "12.1")

insert into "各城市各月平均降水量mm" ("城市", "一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月") values ("上海", "32", "35", "33", "31", "100", "110", "119", "120", "100.0", "50", "50", "50")

insert into "各城市各月平均降水量mm" ("城市", "一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月") values ("南京", "50", "60", "55", "62", "130", "115", "120", "130", "130.0", "77", "77", "77")

insert into "各城市各月平均降水量mm" ("城市", "一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月") values ("杭州", "32", "60", "33", "31", "100", "115", "120", "130", "100.0", "50", "77", "50")

insert into "各城市各月平均降水量mm" ("城市", "一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月") values ("合肥", "50", "60", "55", "62", "130", "115", "120", "120", "100.0", "77", "50", "77")

insert into "各城市各月平均降水量mm" ("城市", "一月", "二月", "三月", "四月", "五月", "六月", "七月", "八月", "九月", "十月", "十一月", "十二月") values ("福州", "50", "60", "55", "31", "130", "110", "120", "120", "130.0", "50", "77", "50")

