PRAGMA foreign_keys = ON;

CREATE TABLE "G20峰会" (
"词条id" int,
"名称" text,
"年份" time,
"届次" int,
"主办国" text,
"主办城市" text,
"参加国家数量" int,
primary key ("词条id")
);

CREATE TABLE "世界经济论坛" (
"年份" time,
"届次" int,
"参加国家数量" int,
"参加的元首人数" int,
"参加总人数" int,
"研讨会数量" int
);

CREATE TABLE "世界物联网博览会" (
"词条id" int,
"名称" text,
"年份" time,
"高峰论坛数量" int,
"参会嘉宾数" int,
"参会企业数" int,
"观展人数" int,
primary key ("词条id")
);

CREATE TABLE "中国国际进口博览会" (
"词条id" int,
"名称" text,
"年份" time,
"参加企业数" int,
"意向成交额" int,
"成交额增长率" int,
primary key ("词条id")
);

insert into "G20峰会" ("词条id", "名称", "年份", "届次", "主办国", "主办城市", "参加国家数量") values ("item_activity_5_26", "2016中国杭州G20峰会", "2016年", "第11届", "中国", "杭州", "90")

insert into "G20峰会" ("词条id", "名称", "年份", "届次", "主办国", "主办城市", "参加国家数量") values ("item_activity_5_27", "2017德国汉堡G20峰会", "2017年", "第12届", "德国", "汉堡", "50")

insert into "G20峰会" ("词条id", "名称", "年份", "届次", "主办国", "主办城市", "参加国家数量") values ("item_activity_5_28", "2015土耳其安塔利亚G20峰会", "2015年", "第10届", "土耳其", "安塔利亚", "48")

insert into "G20峰会" ("词条id", "名称", "年份", "届次", "主办国", "主办城市", "参加国家数量") values ("item_activity_5_29", "2014澳大利亚布里斯班G20峰会", "2014年", "第9届", "澳大利亚", "布里斯班", "45")

insert into "G20峰会" ("词条id", "名称", "年份", "届次", "主办国", "主办城市", "参加国家数量") values ("item_activity_5_30", "2013俄罗斯圣彼得堡G20峰会", "2013年", "第8届", "俄罗斯", "圣彼得堡", "120")

insert into "世界经济论坛" ("年份", "届次", "参加国家数量", "参加的元首人数", "参加总人数", "研讨会数量") values ("2004年", "34届", "30个", "20位", "200名", "50场")

insert into "世界经济论坛" ("年份", "届次", "参加国家数量", "参加的元首人数", "参加总人数", "研讨会数量") values ("2008年", "35届", "90个", "27位", "2500名", "200场")

insert into "世界经济论坛" ("年份", "届次", "参加国家数量", "参加的元首人数", "参加总人数", "研讨会数量") values ("2004年", "36届", "90个", "20位", "2500名", "50场")

insert into "世界经济论坛" ("年份", "届次", "参加国家数量", "参加的元首人数", "参加总人数", "研讨会数量") values ("2008年", "37届", "90个", "20位", "200名", "200场")

insert into "世界经济论坛" ("年份", "届次", "参加国家数量", "参加的元首人数", "参加总人数", "研讨会数量") values ("2004年", "38届", "90个", "20位", "200名", "200场")

insert into "世界物联网博览会" ("词条id", "名称", "年份", "高峰论坛数量", "参会嘉宾数", "参会企业数", "观展人数") values ("item_activity_5_31", "2016世博会", "2015年", "7场", "7000家", "4500家", "15万")

insert into "世界物联网博览会" ("词条id", "名称", "年份", "高峰论坛数量", "参会嘉宾数", "参会企业数", "观展人数") values ("item_activity_5_32", "2017世博会", "2019年", "10场", "9520家", "5300家", "17.3万")

insert into "世界物联网博览会" ("词条id", "名称", "年份", "高峰论坛数量", "参会嘉宾数", "参会企业数", "观展人数") values ("item_activity_5_33", "2018世博会", "2015年", "7场", "9520家", "4500家", "17.3万")

insert into "世界物联网博览会" ("词条id", "名称", "年份", "高峰论坛数量", "参会嘉宾数", "参会企业数", "观展人数") values ("item_activity_5_34", "2015世博会", "2019年", "7场", "9520家", "4500家", "15万")

insert into "世界物联网博览会" ("词条id", "名称", "年份", "高峰论坛数量", "参会嘉宾数", "参会企业数", "观展人数") values ("item_activity_5_35", "2019世博会", "2019年", "10场", "9520家", "5300家", "17.3万")

insert into "中国国际进口博览会" ("词条id", "名称", "年份", "参加企业数", "意向成交额", "成交额增长率") values ("item_activity_5_36", "第一届中国国际进口博览会", "2017年", "20", "500亿", "10%")

insert into "中国国际进口博览会" ("词条id", "名称", "年份", "参加企业数", "意向成交额", "成交额增长率") values ("item_activity_5_37", "第二届中国国际进口博览会", "2018年", "50家", "711亿美元", "24%")

insert into "中国国际进口博览会" ("词条id", "名称", "年份", "参加企业数", "意向成交额", "成交额增长率") values ("item_activity_5_38", "第三届中国国际进口博览会", "2019年", "20", "500亿", "10%")

insert into "中国国际进口博览会" ("词条id", "名称", "年份", "参加企业数", "意向成交额", "成交额增长率") values ("item_activity_5_39", "第二届中国国际进口博览会", "2018年", "20", "711亿美元", "24%")

insert into "中国国际进口博览会" ("词条id", "名称", "年份", "参加企业数", "意向成交额", "成交额增长率") values ("item_activity_5_40", "第三届中国国际进口博览会", "2017年", "50家", "711亿美元", "10%")

