PRAGMA foreign_keys = ON;

CREATE TABLE "房龄影响" (
"城市" text,
"房龄" text,
"交易占比" int
);

CREATE TABLE "电梯影响" (
"城市" text,
"是否带电梯" binary,
"平均成交周期" int,
"平均带看次数" int
);

CREATE TABLE "月供分布" (
"城市" text,
"月供段" text,
"占比" int
);

CREATE TABLE "购房者年龄分布" (
"城市" text,
"购房者年龄段" text,
"占比" int
);

CREATE TABLE "购房者性别分布" (
"城市" text,
"购房者性别" text,
"占比" int
);

insert into "房龄影响" ("城市", "房龄", "交易占比") values ("北京", "5年以内", "4.7%")

insert into "房龄影响" ("城市", "房龄", "交易占比") values ("上海", "5-10年", "25.6%")

insert into "房龄影响" ("城市", "房龄", "交易占比") values ("杭州", "10-15年", "17.8%")

insert into "房龄影响" ("城市", "房龄", "交易占比") values ("苏州", "15-20年", "19.8%")

insert into "房龄影响" ("城市", "房龄", "交易占比") values ("西安", "20年以上", "25.5%")

insert into "电梯影响" ("城市", "是否带电梯", "平均成交周期", "平均带看次数") values ("北京", "是", "60", "16")

insert into "电梯影响" ("城市", "是否带电梯", "平均成交周期", "平均带看次数") values ("上海", "否", "120天", "29")

insert into "电梯影响" ("城市", "是否带电梯", "平均成交周期", "平均带看次数") values ("杭州", "是", "120天", "29")

insert into "电梯影响" ("城市", "是否带电梯", "平均成交周期", "平均带看次数") values ("苏州", "否", "120天", "29")

insert into "电梯影响" ("城市", "是否带电梯", "平均成交周期", "平均带看次数") values ("西安", "否", "120天", "16")

insert into "月供分布" ("城市", "月供段", "占比") values ("北京", "小于5000", "8.1%~10.5%")

insert into "月供分布" ("城市", "月供段", "占比") values ("上海", "5000到1万", "33.6%-40%")

insert into "月供分布" ("城市", "月供段", "占比") values ("杭州", "1万到1.5万", "30.9%~40%")

insert into "月供分布" ("城市", "月供段", "占比") values ("苏州", "1.5万~2万", "14.1%~20%")

insert into "月供分布" ("城市", "月供段", "占比") values ("西安", "2万到3万", "5%~8%")

insert into "购房者年龄分布" ("城市", "购房者年龄段", "占比") values ("北京", "20-30岁", "15.9%")

insert into "购房者年龄分布" ("城市", "购房者年龄段", "占比") values ("上海", "30-40岁", "39.8%")

insert into "购房者年龄分布" ("城市", "购房者年龄段", "占比") values ("杭州", "40-50岁", "25.7%")

insert into "购房者年龄分布" ("城市", "购房者年龄段", "占比") values ("苏州", "50岁以上", "5.6%")

insert into "购房者年龄分布" ("城市", "购房者年龄段", "占比") values ("西安", "50岁以上", "15.9%")

insert into "购房者性别分布" ("城市", "购房者性别", "占比") values ("北京", "", "50%")

insert into "购房者性别分布" ("城市", "购房者性别", "占比") values ("上海", "", "77%")

insert into "购房者性别分布" ("城市", "购房者性别", "占比") values ("杭州", "", "38%")

insert into "购房者性别分布" ("城市", "购房者性别", "占比") values ("苏州", "", "30%")

insert into "购房者性别分布" ("城市", "购房者性别", "占比") values ("西安", "", "50%")

