PRAGMA foreign_keys = ON;

CREATE TABLE "各省份报名人数" (
"省份" text,
"岗位数" int,
"招考人数" int,
"报名人数" int,
"0报名职位数量" int,
"合格人数" int,
"0合格职位数量" int,
"竞争比" int,
primary key ("省份")
);

CREATE TABLE "各职位报名人数" (
"职位名称" text,
"部门名称" text,
"所属地区" text,
"招考人数" int,
"报考人数" int,
"合格人数" int,
foreign key("所属地区") references "各省份报名人数"("省份")
);

CREATE TABLE "各国野鸡大学数量" (
"国家" text,
"大学数量" int,
"野鸡大学数量" int
);

CREATE TABLE "中国各城市野鸡大学数量" (
"城市" text,
"野鸡大学数量" int,
"占比" int
);

insert into "各省份报名人数" ("省份", "岗位数", "招考人数", "报名人数", "0报名职位数量", "合格人数", "0合格职位数量", "竞争比") values ("安徽", "255", "438", "22848", "1", "21299", "3", "37")

insert into "各省份报名人数" ("省份", "岗位数", "招考人数", "报名人数", "0报名职位数量", "合格人数", "0合格职位数量", "竞争比") values ("贵州", "215", "338", "22848", "1", "21299", "3", "37")

insert into "各省份报名人数" ("省份", "岗位数", "招考人数", "报名人数", "0报名职位数量", "合格人数", "0合格职位数量", "竞争比") values ("吉林", "355", "468", "22848", "1", "21299", "3", "37")

insert into "各省份报名人数" ("省份", "岗位数", "招考人数", "报名人数", "0报名职位数量", "合格人数", "0合格职位数量", "竞争比") values ("北京", "987", "2010", "227628", "5", "208381", "7", "113")

insert into "各省份报名人数" ("省份", "岗位数", "招考人数", "报名人数", "0报名职位数量", "合格人数", "0合格职位数量", "竞争比") values ("福建", "987", "2010", "22848", "1", "21299", "3", "37")

insert into "各省份报名人数" ("省份", "岗位数", "招考人数", "报名人数", "0报名职位数量", "合格人数", "0合格职位数量", "竞争比") values ("甘肃", "255", "2010", "22848", "5", "21299", "3", "37")

insert into "各省份报名人数" ("省份", "岗位数", "招考人数", "报名人数", "0报名职位数量", "合格人数", "0合格职位数量", "竞争比") values ("广东", "987", "2010", "227628", "5", "21299", "7", "113")

insert into "各职位报名人数" ("职位名称", "部门名称", "所属地区", "招考人数", "报考人数", "合格人数") values ("监管二级主办及以下", "深圳海关", "广东", "11", "5447", "5021")

insert into "各职位报名人数" ("职位名称", "部门名称", "所属地区", "招考人数", "报考人数", "合格人数") values ("英语五", "外交部", "北京", "22", "4569", "4210")

insert into "各职位报名人数" ("职位名称", "部门名称", "所属地区", "招考人数", "报考人数", "合格人数") values ("科研管理处一级主任科员及以下", "中央社会主义学院", "北京", "4", "3614", "3591")

insert into "各职位报名人数" ("职位名称", "部门名称", "所属地区", "招考人数", "报考人数", "合格人数") values ("一级行政执法员", "贵州省税务局", "贵州", "2", "3592", "3471")

insert into "各职位报名人数" ("职位名称", "部门名称", "所属地区", "招考人数", "报考人数", "合格人数") values ("吉林铁路公安处线路警务区民警", "沈阳铁路公安局", "吉林", "5", "3102", "2196")

insert into "各国野鸡大学数量" ("国家", "大学数量", "野鸡大学数量") values ("美国", "1000", "855")

insert into "各国野鸡大学数量" ("国家", "大学数量", "野鸡大学数量") values ("英国", "2000", "87")

insert into "各国野鸡大学数量" ("国家", "大学数量", "野鸡大学数量") values ("加拿大", "1000", "18")

insert into "各国野鸡大学数量" ("国家", "大学数量", "野鸡大学数量") values ("新加坡", "2000", "11")

insert into "各国野鸡大学数量" ("国家", "大学数量", "野鸡大学数量") values ("爱尔兰", "2000", "10")

insert into "中国各城市野鸡大学数量" ("城市", "野鸡大学数量", "占比") values ("北京", "83", "44%")

insert into "中国各城市野鸡大学数量" ("城市", "野鸡大学数量", "占比") values ("上海", "15", "85")

insert into "中国各城市野鸡大学数量" ("城市", "野鸡大学数量", "占比") values ("山东", "12", "5%")

insert into "中国各城市野鸡大学数量" ("城市", "野鸡大学数量", "占比") values ("天津", "10", "6%")

insert into "中国各城市野鸡大学数量" ("城市", "野鸡大学数量", "占比") values (" 河北", "84", "4%")

