PRAGMA foreign_keys = ON;

CREATE TABLE "城市" (
"词条id" int,
"名称" text,
"所属省份" text,
"垃圾产出量(万吨)" int,
"垃圾场数量" int,
primary key ("词条id")
);

CREATE TABLE "城市垃圾来源" (
"城市id" int,
"来源" text,
"产出吨数" int,
"总量占比" int,
foreign key("城市id") references "城市"("词条id")
);

CREATE TABLE "垃圾分类的城市" (
"城市id" int,
"实施时间" time,
"分类体系" text,
"最低罚款数" int,
"最高罚款数" int,
"厨余垃圾运输车辆" int,
"有害垃圾运输车辆" int,
"覆盖家庭比例" int,
"志愿者数量" int,
primary key ("城市id"),
foreign key("城市id") references "城市"("词条id")
);

insert into "城市" ("词条id", "名称", "所属省份", "垃圾产出量(万吨)", "垃圾场数量") values ("item_geostatistics_12_56", "广州", "广东过", "", "738")

insert into "城市" ("词条id", "名称", "所属省份", "垃圾产出量(万吨)", "垃圾场数量") values ("item_geostatistics_12_57", "深圳", "广东", "", "604")

insert into "城市" ("词条id", "名称", "所属省份", "垃圾产出量(万吨)", "垃圾场数量") values ("item_geostatistics_12_58", "成都", "四川", "", "541")

insert into "城市" ("词条id", "名称", "所属省份", "垃圾产出量(万吨)", "垃圾场数量") values ("item_geostatistics_12_59", "西安", "陕西", "", "423")

insert into "城市" ("词条id", "名称", "所属省份", "垃圾产出量(万吨)", "垃圾场数量") values ("item_geostatistics_12_60", "杭州", "浙江", "", "400")

insert into "城市垃圾来源" ("城市id", "来源", "产出吨数", "总量占比") values ("item_geostatistics_12_57", "工业垃圾", "50万吨", "20%")

insert into "城市垃圾来源" ("城市id", "来源", "产出吨数", "总量占比") values ("item_geostatistics_12_60", "农业垃圾", "200万吨", "50%")

insert into "城市垃圾来源" ("城市id", "来源", "产出吨数", "总量占比") values ("item_geostatistics_12_60", "生活垃圾", "200万吨", "50%")

insert into "城市垃圾来源" ("城市id", "来源", "产出吨数", "总量占比") values ("item_geostatistics_12_60", "工业垃圾", "200万吨", "20%")

insert into "城市垃圾来源" ("城市id", "来源", "产出吨数", "总量占比") values ("item_geostatistics_12_58", "生活垃圾", "50万吨", "50%")

insert into "垃圾分类的城市" ("城市id", "实施时间", "分类体系", "最低罚款数", "最高罚款数", "厨余垃圾运输车辆", "有害垃圾运输车辆", "覆盖家庭比例", "志愿者数量") values ("item_geostatistics_12_60", "2019年6月", "干湿分类体系", "5000", "10000", "3000", "500", "60", "50万")

insert into "垃圾分类的城市" ("城市id", "实施时间", "分类体系", "最低罚款数", "最高罚款数", "厨余垃圾运输车辆", "有害垃圾运输车辆", "覆盖家庭比例", "志愿者数量") values ("item_geostatistics_12_57", "2020年5月", "厨余其他体系", "10000", "50000", "5000", "1000", "80%", "70万")

insert into "垃圾分类的城市" ("城市id", "实施时间", "分类体系", "最低罚款数", "最高罚款数", "厨余垃圾运输车辆", "有害垃圾运输车辆", "覆盖家庭比例", "志愿者数量") values ("item_geostatistics_12_59", "2019年6月", "厨余其他体系", "10000", "50000", "5000", "500", "80%", "50万")

insert into "垃圾分类的城市" ("城市id", "实施时间", "分类体系", "最低罚款数", "最高罚款数", "厨余垃圾运输车辆", "有害垃圾运输车辆", "覆盖家庭比例", "志愿者数量") values ("item_geostatistics_12_57", "2019年6月", "厨余其他体系", "5000", "10000", "3000", "1000", "80%", "70万")

insert into "垃圾分类的城市" ("城市id", "实施时间", "分类体系", "最低罚款数", "最高罚款数", "厨余垃圾运输车辆", "有害垃圾运输车辆", "覆盖家庭比例", "志愿者数量") values ("item_geostatistics_12_56", "2020年5月", "厨余其他体系", "5000", "10000", "5000", "1000", "60", "50万")

