PRAGMA foreign_keys = ON;

CREATE TABLE "城市" (
"词条id" int,
"名称" text,
"所属省份" text,
"常住人口" int,
"城区面积" int,
"建城年数" int,
primary key ("词条id")
);

CREATE TABLE "都城" (
"朝代" text,
"古称" text,
"城市id" int,
"建都起始时间" time,
"建都结束时间" time,
"建都年数" int,
foreign key("城市id") references "城市"("词条id")
);

insert into "城市" ("词条id", "名称", "所属省份", "常住人口", "城区面积", "建城年数") values ("item_geography.2_11_101", "北京", "北京", "2172.9万人", "16412平方千米", "3065年")

insert into "城市" ("词条id", "名称", "所属省份", "常住人口", "城区面积", "建城年数") values ("item_geography.2_11_102", "承德", "河北", "369万人", "39519平方公里", "139年")

insert into "城市" ("词条id", "名称", "所属省份", "常住人口", "城区面积", "建城年数") values ("item_geography.2_11_103", "大同", "山西", "331万人", "14176平方公里", "2238年")

insert into "城市" ("词条id", "名称", "所属省份", "常住人口", "城区面积", "建城年数") values ("item_geography.2_11_104", "南京", "南京", "827万人", "6587.02平方公里", "2491年")

insert into "城市" ("词条id", "名称", "所属省份", "常住人口", "城区面积", "建城年数") values ("item_geography.2_11_105", "苏州", "苏州", "1062.57万", "8488.42平方公里", "2500年")

insert into "都城" ("朝代", "古称", "城市id", "建都起始时间", "建都结束时间", "建都年数") values ("清", "京", "item_geography.2_11_105", "1636年", "1912年", "296年")

insert into "都城" ("朝代", "古称", "城市id", "建都起始时间", "建都结束时间", "建都年数") values ("周", "洛", "item_geography.2_11_102", "前1046年", "前256年", "791年")

insert into "都城" ("朝代", "古称", "城市id", "建都起始时间", "建都结束时间", "建都年数") values ("东吴", "宁", "item_geography.2_11_103", "222年", "280年", "52年")

insert into "都城" ("朝代", "古称", "城市id", "建都起始时间", "建都结束时间", "建都年数") values ("魏国", "汴", "item_geography.2_11_101", "前403年", "前225年", "179年")

insert into "都城" ("朝代", "古称", "城市id", "建都起始时间", "建都结束时间", "建都年数") values ("秦", "长安", "item_geography.2_11_104", "前221年", "前207年", "14年")

