PRAGMA foreign_keys = ON;

CREATE TABLE "各省财政收入" (
"省份" text,
"GDP总计(亿)" int,
"GDP同比增速" int,
"GDP省内排名" int,
"固定资产投资同比增速" int,
"财政预算收入(亿)" int,
"财政预算同比增速" int,
"预算支出额度(亿)" int,
"预算赤字率" int,
"收入透明度" int
);

CREATE TABLE "300城土地供给" (
"年份" time,
"整体土地供给规划面积(亿平)" int,
"整体累计同比" int,
"一线城市土地供给规划面积(万平)" int,
"一线城市累计同比" int,
"二线城市土地供给规划面积(亿平)" int,
"二线城市累计同比" int,
"三四线城市土地供给规划面积(亿平)" int,
"三四线城市累计同比" int
);

CREATE TABLE "300城土地成交" (
"年份" time,
"成交建筑面积" int,
"成交累计同比" int,
"土地出让金" int,
"一线城市成交建筑面积" int,
"一线成交累计同比" int,
"一线城市土地出让金" int,
"二线城市成交建筑面积" int,
"二线成交累计同比" int,
"二线城市土地出让金" int,
"三四线城市成交建筑面积" int,
"三四线成交累计同比" int,
"三四线城市土地出让金" int
);

insert into "各省财政收入" ("省份", "GDP总计(亿)", "GDP同比增速", "GDP省内排名", "固定资产投资同比增速", "财政预算收入(亿)", "财政预算同比增速", "预算支出额度(亿)", "预算赤字率", "收入透明度") values ("广东", "", "5%", "1", "-6", "", "-16%", "", "5%", "55%")

insert into "各省财政收入" ("省份", "GDP总计(亿)", "GDP同比增速", "GDP省内排名", "固定资产投资同比增速", "财政预算收入(亿)", "财政预算同比增速", "预算支出额度(亿)", "预算赤字率", "收入透明度") values ("江苏", "", "15%", "7", "16%", "", "24%", "", "45%", "83%")

insert into "各省财政收入" ("省份", "GDP总计(亿)", "GDP同比增速", "GDP省内排名", "固定资产投资同比增速", "财政预算收入(亿)", "财政预算同比增速", "预算支出额度(亿)", "预算赤字率", "收入透明度") values ("山东", "", "5%", "1", "16%", "", "24%", "", "5%", "83%")

insert into "各省财政收入" ("省份", "GDP总计(亿)", "GDP同比增速", "GDP省内排名", "固定资产投资同比增速", "财政预算收入(亿)", "财政预算同比增速", "预算支出额度(亿)", "预算赤字率", "收入透明度") values ("浙江", "", "5%", "7", "16%", "", "-16%", "", "5%", "83%")

insert into "各省财政收入" ("省份", "GDP总计(亿)", "GDP同比增速", "GDP省内排名", "固定资产投资同比增速", "财政预算收入(亿)", "财政预算同比增速", "预算支出额度(亿)", "预算赤字率", "收入透明度") values ("河南", "", "5%", "1", "16%", "", "-16%", "", "5%", "55%")

insert into "300城土地供给" ("年份", "整体土地供给规划面积(亿平)", "整体累计同比", "一线城市土地供给规划面积(万平)", "一线城市累计同比", "二线城市土地供给规划面积(亿平)", "二线城市累计同比", "三四线城市土地供给规划面积(亿平)", "三四线城市累计同比") values ("2014", "", "", "", "-30%", "", "-20%", "", "-20%")

insert into "300城土地供给" ("年份", "整体土地供给规划面积(亿平)", "整体累计同比", "一线城市土地供给规划面积(万平)", "一线城市累计同比", "二线城市土地供给规划面积(亿平)", "二线城市累计同比", "三四线城市土地供给规划面积(亿平)", "三四线城市累计同比") values ("2015", "", "", "", "20%", "", "60%", "", "120%")

insert into "300城土地供给" ("年份", "整体土地供给规划面积(亿平)", "整体累计同比", "一线城市土地供给规划面积(万平)", "一线城市累计同比", "二线城市土地供给规划面积(亿平)", "二线城市累计同比", "三四线城市土地供给规划面积(亿平)", "三四线城市累计同比") values ("2016", "", "", "", "20%", "", "60%", "", "120%")

insert into "300城土地供给" ("年份", "整体土地供给规划面积(亿平)", "整体累计同比", "一线城市土地供给规划面积(万平)", "一线城市累计同比", "二线城市土地供给规划面积(亿平)", "二线城市累计同比", "三四线城市土地供给规划面积(亿平)", "三四线城市累计同比") values ("2017", "", "", "", "-30%", "", "60%", "", "-20%")

insert into "300城土地供给" ("年份", "整体土地供给规划面积(亿平)", "整体累计同比", "一线城市土地供给规划面积(万平)", "一线城市累计同比", "二线城市土地供给规划面积(亿平)", "二线城市累计同比", "三四线城市土地供给规划面积(亿平)", "三四线城市累计同比") values ("2018", "", "", "", "20%", "", "-20%", "", "120%")

insert into "300城土地成交" ("年份", "成交建筑面积", "成交累计同比", "土地出让金", "一线城市成交建筑面积", "一线成交累计同比", "一线城市土地出让金", "二线城市成交建筑面积", "二线成交累计同比", "二线城市土地出让金", "三四线城市成交建筑面积", "三四线成交累计同比", "三四线城市土地出让金") values ("2014", "15", "-10%", "5", "4000", "-10%", "1000", "3", "0", "3", "3", "-10%", "1")

insert into "300城土地成交" ("年份", "成交建筑面积", "成交累计同比", "土地出让金", "一线城市成交建筑面积", "一线成交累计同比", "一线城市土地出让金", "二线城市成交建筑面积", "二线成交累计同比", "二线城市土地出让金", "三四线城市成交建筑面积", "三四线成交累计同比", "三四线城市土地出让金") values ("2015", "35", "50%", "35", "9000", "50%", "5000", "10", "100%", "18", "18", "200%", "18")

insert into "300城土地成交" ("年份", "成交建筑面积", "成交累计同比", "土地出让金", "一线城市成交建筑面积", "一线成交累计同比", "一线城市土地出让金", "二线城市成交建筑面积", "二线成交累计同比", "二线城市土地出让金", "三四线城市成交建筑面积", "三四线成交累计同比", "三四线城市土地出让金") values ("2016", "15", "-10%", "5", "4000", "-10%", "5000", "3", "100%", "3", "18", "-10%", "1")

insert into "300城土地成交" ("年份", "成交建筑面积", "成交累计同比", "土地出让金", "一线城市成交建筑面积", "一线成交累计同比", "一线城市土地出让金", "二线城市成交建筑面积", "二线成交累计同比", "二线城市土地出让金", "三四线城市成交建筑面积", "三四线成交累计同比", "三四线城市土地出让金") values ("2017", "35", "-10%", "5", "4000", "50%", "1000", "10", "100%", "18", "3", "-10%", "1")

insert into "300城土地成交" ("年份", "成交建筑面积", "成交累计同比", "土地出让金", "一线城市成交建筑面积", "一线成交累计同比", "一线城市土地出让金", "二线城市成交建筑面积", "二线成交累计同比", "二线城市土地出让金", "三四线城市成交建筑面积", "三四线成交累计同比", "三四线城市土地出让金") values ("2018", "15", "-10%", "5", "4000", "50%", "1000", "10", "0", "3", "18", "-10%", "1")

