PRAGMA foreign_keys = ON;

CREATE TABLE "冬季奥运会" (
"词条id" int,
"名称" text,
"届数" int,
"举办城市" text,
"举办国家" text,
"时间" time,
"参赛国家数量" int,
"比赛项目数量" int,
"参赛运动员数量" int,
primary key ("词条id")
);

CREATE TABLE "奥运会赞助商" (
"赞助商名称" text,
"奥运会id" int,
foreign key("奥运会id") references "冬季奥运会"("词条id")
);

CREATE TABLE "2018年奖牌榜" (
"排名" int,
"国家" text,
"金牌数" int,
"银牌数" int,
"铜牌数" int,
"奖牌总数" int
);

insert into "冬季奥运会" ("词条id", "名称", "届数", "举办城市", "举办国家", "时间", "参赛国家数量", "比赛项目数量", "参赛运动员数量") values ("item_sports.2_17_141", "夏慕尼", "1", "法国夏慕尼", "夏慕尼", "1924年1月25日", "16个", "4个", "294名")

insert into "冬季奥运会" ("词条id", "名称", "届数", "举办城市", "举办国家", "时间", "参赛国家数量", "比赛项目数量", "参赛运动员数量") values ("item_sports.2_17_142", "圣莫里茨", "2", "瑞士圣莫里茨", "圣莫里茨", "1928年2月11日", "25个", "4个", "464名")

insert into "冬季奥运会" ("词条id", "名称", "届数", "举办城市", "举办国家", "时间", "参赛国家数量", "比赛项目数量", "参赛运动员数量") values ("item_sports.2_17_143", "普莱西德湖", "3", "美国普莱西德湖", "普莱西德湖", "1932年2月4日", "17个", "4个", "252名")

insert into "冬季奥运会" ("词条id", "名称", "届数", "举办城市", "举办国家", "时间", "参赛国家数量", "比赛项目数量", "参赛运动员数量") values ("item_sports.2_17_144", "加尔米施-帕滕基兴", "4", "德国加尔米施-帕滕基兴", "加尔米施-帕滕基兴", "1936年2月6日", "28个", "4个", "669名")

insert into "冬季奥运会" ("词条id", "名称", "届数", "举办城市", "举办国家", "时间", "参赛国家数量", "比赛项目数量", "参赛运动员数量") values ("item_sports.2_17_145", "圣莫里茨", "5", "瑞士圣莫里茨", "瑞士圣莫里茨", "1948年1月30日", "28个", "4个", "0")

insert into "奥运会赞助商" ("赞助商名称", "奥运会id") values ("中国人保财险", "item_sports.2_17_143")

insert into "奥运会赞助商" ("赞助商名称", "奥运会id") values ("中国银行", "item_sports.2_17_142")

insert into "奥运会赞助商" ("赞助商名称", "奥运会id") values ("中国石油", "item_sports.2_17_144")

insert into "奥运会赞助商" ("赞助商名称", "奥运会id") values ("国家电网", "item_sports.2_17_143")

insert into "奥运会赞助商" ("赞助商名称", "奥运会id") values ("中国网通", "item_sports.2_17_143")

insert into "2018年奖牌榜" ("排名", "国家", "金牌数", "银牌数", "铜牌数", "奖牌总数") values ("1", "中国", "132", "92", "65", "289")

insert into "2018年奖牌榜" ("排名", "国家", "金牌数", "银牌数", "铜牌数", "奖牌总数") values ("2", "日本", "75", "56", "74", "205")

insert into "2018年奖牌榜" ("排名", "国家", "金牌数", "银牌数", "铜牌数", "奖牌总数") values ("3", "韩国", "49", "58", "70", "177")

insert into "2018年奖牌榜" ("排名", "国家", "金牌数", "银牌数", "铜牌数", "奖牌总数") values ("4", "印尼", "31", "24", "43", "98")

insert into "2018年奖牌榜" ("排名", "国家", "金牌数", "银牌数", "铜牌数", "奖牌总数") values ("5", "乌兹别克斯坦", "21", "24", "25", "70")

