PRAGMA foreign_keys = ON;

CREATE TABLE "国家" (
"词条id" int,
"名称" text,
"人口数量" int,
"民用枪支数" int,
"军用枪支数" int,
"每100人持有的民用枪支数" int,
primary key ("词条id")
);

CREATE TABLE "枪击事件" (
"年份" time,
"国家id" int,
"枪击事件数量" int,
"死亡人数" int,
"受伤人数" int,
foreign key("国家id") references "国家"("词条id")
);

CREATE TABLE "美国近几年校园枪击事件" (
"年份" time,
"发生城市" text,
"受影响学生数量" int,
"伤亡人数" int,
"枪击者年龄" int,
"枪击者国籍" text
);

CREATE TABLE "韩国自杀的娱乐明星" (
"姓名" text,
"性别" text,
"年龄" int,
"死亡时间" time,
"是否患抑郁症" binary
);

insert into "国家" ("词条id", "名称", "人口数量", "民用枪支数", "军用枪支数", "每100人持有的民用枪支数") values ("item_activity_11_101", "美国", "3.3亿", "393347000", "4535380", "120.5")

insert into "国家" ("词条id", "名称", "人口数量", "民用枪支数", "军用枪支数", "每100人持有的民用枪支数") values ("item_activity_11_102", "也门", "2758万", "14859000", "28500", "52.8")

insert into "国家" ("词条id", "名称", "人口数量", "民用枪支数", "军用枪支数", "每100人持有的民用枪支数") values ("item_activity_11_103", "塞尔维亚", "718万", "2719000", "384422", "39.1")

insert into "国家" ("词条id", "名称", "人口数量", "民用枪支数", "军用枪支数", "每100人持有的民用枪支数") values ("item_activity_11_104", "乌拉圭", "3444006人", "1198000", "62130", "34.7")

insert into "国家" ("词条id", "名称", "人口数量", "民用枪支数", "军用枪支数", "每100人持有的民用枪支数") values ("item_activity_11_105", "3707万", "12708000", "233949", "34", "7")

insert into "枪击事件" ("年份", "国家id", "枪击事件数量", "死亡人数", "受伤人数") values ("2015", "item_activity_11_102", "10", "4", "20")

insert into "枪击事件" ("年份", "国家id", "枪击事件数量", "死亡人数", "受伤人数") values ("2018年", "item_activity_11_105", "346", "49", "53")

insert into "枪击事件" ("年份", "国家id", "枪击事件数量", "死亡人数", "受伤人数") values ("2018年", "item_activity_11_101", "346", "4", "20")

insert into "枪击事件" ("年份", "国家id", "枪击事件数量", "死亡人数", "受伤人数") values ("2015", "item_activity_11_103", "346", "49", "20")

insert into "枪击事件" ("年份", "国家id", "枪击事件数量", "死亡人数", "受伤人数") values ("2015", "item_activity_11_101", "10", "4", "53")

insert into "美国近几年校园枪击事件" ("年份", "发生城市", "受影响学生数量", "伤亡人数", "枪击者年龄", "枪击者国籍") values ("2015年", "德克萨斯", "1000", "20", "15", "美国")

insert into "美国近几年校园枪击事件" ("年份", "发生城市", "受影响学生数量", "伤亡人数", "枪击者年龄", "枪击者国籍") values ("2019年", "佛罗里达", "10000", "100", "55岁", "墨西哥")

insert into "美国近几年校园枪击事件" ("年份", "发生城市", "受影响学生数量", "伤亡人数", "枪击者年龄", "枪击者国籍") values ("2015年", "拉斯维加斯", "1000", "100", "15", "印度")

insert into "美国近几年校园枪击事件" ("年份", "发生城市", "受影响学生数量", "伤亡人数", "枪击者年龄", "枪击者国籍") values ("2019年", "南加州", "1000", "100", "55岁", "德国")

insert into "美国近几年校园枪击事件" ("年份", "发生城市", "受影响学生数量", "伤亡人数", "枪击者年龄", "枪击者国籍") values ("2019年", "纽约", "1000", "20", "15", "伊朗")

insert into "韩国自杀的娱乐明星" ("姓名", "性别", "年龄", "死亡时间", "是否患抑郁症") values ("具荷拉", "男", "20岁", "2015年1月1日", "是")

insert into "韩国自杀的娱乐明星" ("姓名", "性别", "年龄", "死亡时间", "是否患抑郁症") values ("雪梨", "女", "40岁", "2019年11月30日", "否")

insert into "韩国自杀的娱乐明星" ("姓名", "性别", "年龄", "死亡时间", "是否患抑郁症") values ("崔真实", "男", "40岁", "2015年1月1日", "否")

insert into "韩国自杀的娱乐明星" ("姓名", "性别", "年龄", "死亡时间", "是否患抑郁症") values ("张紫妍", "男", "20岁", "2015年1月1日", "否")

insert into "韩国自杀的娱乐明星" ("姓名", "性别", "年龄", "死亡时间", "是否患抑郁症") values ("李恩珠", "女", "20岁", "2019年11月30日", "是")

