PRAGMA foreign_keys = ON;

CREATE TABLE "2018年宜居城市" (
"城市" text,
"所属省份" text,
"分数" int,
"空气指数" int,
"蓝天数量" int
);

CREATE TABLE "2017年宜居城市" (
"城市" text,
"所属省份" text,
"分数" int,
"空气指数" int,
"蓝天数量" int
);

CREATE TABLE "2016年宜居城市" (
"城市" text,
"所属省份" text,
"分数" int,
"空气指数" int,
"蓝天数量" int
);

insert into "2018年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("珠海", "广东", "89", "优", "优")

insert into "2018年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("威海", "山东", "90", "优", "优")

insert into "2018年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("信阳", "河南", "87", "优", "优")

insert into "2018年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("金华", "浙江", "88", "优", "优")

insert into "2018年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("芜湖", "安徽", "86", "优", "优")

insert into "2017年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("珠海", "广东", "89", "优", "优")

insert into "2017年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("威海", "山东", "90", "优", "优")

insert into "2017年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("信阳", "河南", "87", "优", "优")

insert into "2017年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("惠州", "广东", "88", "优", "优")

insert into "2017年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("金华", "浙江", "86", "优", "优")

insert into "2016年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("珠海", "广东", "89", "优", "优")

insert into "2016年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("威海", "山东", "90", "优", "优")

insert into "2016年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("信阳", "河南", "87", "优", "优")

insert into "2016年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("惠州", "广东", "88", "优", "优")

insert into "2016年宜居城市" ("城市", "所属省份", "分数", "空气指数", "蓝天数量") values ("厦门", "福建", "86", "优", "优")

