PRAGMA foreign_keys = ON;

CREATE TABLE "两院院士学校名单" (
"学校" text,
"所在省市" text,
"所在城市" text,
"院士人数" int
);

CREATE TABLE "两院院士民族名单" (
"民族" text,
"院士人数" int,
"所占比例" int
);

CREATE TABLE "各国女院士比例" (
"国家" text,
"女院士人数" int,
"所占比例" int
);

CREATE TABLE "各学部院士分布" (
"年份" time,
"学部" text,
"院士人数" int,
"所占比例" int
);

insert into "两院院士学校名单" ("学校", "所在省市", "所在城市", "院士人数") values ("清华大学", "北京", "北京", "15")

insert into "两院院士学校名单" ("学校", "所在省市", "所在城市", "院士人数") values ("北京大学", "江苏", "南京", "100")

insert into "两院院士学校名单" ("学校", "所在省市", "所在城市", "院士人数") values ("南京大学", "上海", "上海", "15")

insert into "两院院士学校名单" ("学校", "所在省市", "所在城市", "院士人数") values ("复旦大学", "浙江", "杭州", "15")

insert into "两院院士学校名单" ("学校", "所在省市", "所在城市", "院士人数") values ("上海交通大学", "吉林", "长春", "15")

insert into "两院院士民族名单" ("民族", "院士人数", "所占比例") values ("汉族", "1", "0.05%")

insert into "两院院士民族名单" ("民族", "院士人数", "所占比例") values ("满族", "1812", "98%")

insert into "两院院士民族名单" ("民族", "院士人数", "所占比例") values ("蒙古族", "1812", "0.05%")

insert into "两院院士民族名单" ("民族", "院士人数", "所占比例") values ("回族", "1", "98%")

insert into "两院院士民族名单" ("民族", "院士人数", "所占比例") values ("土家族", "1", "0.05%")

insert into "各国女院士比例" ("国家", "女院士人数", "所占比例") values ("中国", "50", "3.2%")

insert into "各国女院士比例" ("国家", "女院士人数", "所占比例") values ("美国", "93", "5.1%")

insert into "各国女院士比例" ("国家", "女院士人数", "所占比例") values ("丹麦", "50", "5.1%")

insert into "各国女院士比例" ("国家", "女院士人数", "所占比例") values ("英国", "50", "5.1%")

insert into "各国女院士比例" ("国家", "女院士人数", "所占比例") values ("加拿大", "50", "3.2%")

insert into "各学部院士分布" ("年份", "学部", "院士人数", "所占比例") values ("2007", "数学物理部", "6-11", "3%")

insert into "各学部院士分布" ("年份", "学部", "院士人数", "所占比例") values ("2019", "化学部", "6-10", "24%")

insert into "各学部院士分布" ("年份", "学部", "院士人数", "所占比例") values ("2019", "生物学部", " 7-13", "24%")

insert into "各学部院士分布" ("年份", "学部", "院士人数", "所占比例") values ("2007", "地学部", "4-11", "3%")

insert into "各学部院士分布" ("年份", "学部", "院士人数", "所占比例") values ("2019", "信息技术科学部", "1-8", "24%")

