PRAGMA foreign_keys = ON;

CREATE TABLE "各省中小学假期" (
"省份" text,
"年级" text,
"寒假天数" int,
"暑假天数" int
);

CREATE TABLE "大学假期" (
"学校" text,
"所属省份" text,
"寒假天数" int,
"暑假天数" int
);

insert into "各省中小学假期" ("省份", "年级", "寒假天数", "暑假天数") values ("黑龙江", "1-6年级", "20", "30")

insert into "各省中小学假期" ("省份", "年级", "寒假天数", "暑假天数") values ("上海", "7-8年级", "35天", "60天")

insert into "各省中小学假期" ("省份", "年级", "寒假天数", "暑假天数") values ("陕西", "9年级", "20", "60天")

insert into "各省中小学假期" ("省份", "年级", "寒假天数", "暑假天数") values ("江苏", "高中一二年级", "20", "60天")

insert into "各省中小学假期" ("省份", "年级", "寒假天数", "暑假天数") values ("贵州", "高三年级", "35天", "30")

insert into "大学假期" ("学校", "所属省份", "寒假天数", "暑假天数") values ("哈尔滨工程大学", "黑龙江", "30", "35")

insert into "大学假期" ("学校", "所属省份", "寒假天数", "暑假天数") values ("贵州师范大学", "贵州", "55", "50")

insert into "大学假期" ("学校", "所属省份", "寒假天数", "暑假天数") values ("华南理工大学", "广东", "30", "35")

insert into "大学假期" ("学校", "所属省份", "寒假天数", "暑假天数") values ("重庆邮电大学", "重庆", "55", "50")

insert into "大学假期" ("学校", "所属省份", "寒假天数", "暑假天数") values ("湘潭大学", "湖南", "55", "35")

