PRAGMA foreign_keys = ON;

CREATE TABLE "省份" (
"词条id" int,
"名称" text,
"500强企业数量" int,
"总营收(亿元)" int,
"总利润(亿元)" int,
primary key ("词条id")
);

CREATE TABLE "企业" (
"词条id" int,
"名称" text,
"省份id" int,
"成立时间" time,
"公司类型" text,
"领域分类" text,
"年营业额" int,
"员工数" int,
"注册资本" int,
"500强排名" int,
primary key ("词条id"),
foreign key("省份id") references "省份"("词条id")
);

insert into "省份" ("词条id", "名称", "500强企业数量", "总营收(亿元)", "总利润(亿元)") values ("item_geography.2_16_141", "北京", "56", "", "")

insert into "省份" ("词条id", "名称", "500强企业数量", "总营收(亿元)", "总利润(亿元)") values ("item_geography.2_16_142", "深圳", "7", "", "")

insert into "省份" ("词条id", "名称", "500强企业数量", "总营收(亿元)", "总利润(亿元)") values ("item_geography.2_16_143", "上海", "7", "", "")

insert into "省份" ("词条id", "名称", "500强企业数量", "总营收(亿元)", "总利润(亿元)") values ("item_geography.2_16_144", "台北", "6", "", "")

insert into "省份" ("词条id", "名称", "500强企业数量", "总营收(亿元)", "总利润(亿元)") values ("item_geography.2_16_145", "香港", "7", "", "")

insert into "企业" ("词条id", "名称", "省份id", "成立时间", "公司类型", "领域分类", "年营业额", "员工数", "注册资本", "500强排名") values ("item_geography.2_16_146", "中石化", "item_geography.2_16_143", "1987年", "国有企业", "燃气", "4146亿美元", "20000", "1820亿元", "2")

insert into "企业" ("词条id", "名称", "省份id", "成立时间", "公司类型", "领域分类", "年营业额", "员工数", "注册资本", "500强排名") values ("item_geography.2_16_147", "中石油", "item_geography.2_16_142", "1998年", "上市公司", "电力", "3929亿美元", "100000", "1149亿元", "4")

insert into "企业" ("词条id", "名称", "省份id", "成立时间", "公司类型", "领域分类", "年营业额", "员工数", "注册资本", "500强排名") values ("item_geography.2_16_148", "国家电网", "item_geography.2_16_141", "2002年", "上市公司", "金融业", "3870亿美元", "20000", "2000亿元人民币", "2")

insert into "企业" ("词条id", "名称", "省份id", "成立时间", "公司类型", "领域分类", "年营业额", "员工数", "注册资本", "500强排名") values ("item_geography.2_16_149", "中国平安", "item_geography.2_16_144", "1988年", "上市公司", "制造业", "1635.9亿美元", "100000", "5万亿元人民币", "8")

insert into "企业" ("词条id", "名称", "省份id", "成立时间", "公司类型", "领域分类", "年营业额", "员工数", "注册资本", "500强排名") values ("item_geography.2_16_150", "上汽集团", "item_geography.2_16_141", "1984年", "国有企业", "燃气", "1363.9亿美元", "100000", "1168346.136500万人民币", "46")

