PRAGMA foreign_keys = ON;

CREATE TABLE "城市" (
"词条id" int,
"名称" text,
"所属省份" text,
"占地面积" int,
"体育馆数量" int,
primary key ("词条id")
);

CREATE TABLE "运动会" (
"举办城市id" int,
"运动会类型" text,
"届数" int,
"年份" time,
"参赛运动员数量" int,
"项目数量" int,
"金牌数量" int,
"奖牌数量" int,
foreign key("举办城市id") references "城市"("词条id")
);

insert into "城市" ("词条id", "名称", "所属省份", "占地面积", "体育馆数量") values ("item_geography.2_13_121", "北京", "北京", "140万", "30")

insert into "城市" ("词条id", "名称", "所属省份", "占地面积", "体育馆数量") values ("item_geography.2_13_122", "天津", "天津", "200万", "24")

insert into "城市" ("词条id", "名称", "所属省份", "占地面积", "体育馆数量") values ("item_geography.2_13_123", "上海", "上海", "200万", "32")

insert into "城市" ("词条id", "名称", "所属省份", "占地面积", "体育馆数量") values ("item_geography.2_13_124", "广州", "广东", "140万", "28")

insert into "城市" ("词条id", "名称", "所属省份", "占地面积", "体育馆数量") values ("item_geography.2_13_125", "郑州", "河南", "140万", "17")

insert into "运动会" ("举办城市id", "运动会类型", "届数", "年份", "参赛运动员数量", "项目数量", "金牌数量", "奖牌数量") values ("item_geography.2_13_122", "亚运会", "16", "2010", "9704", "42", "72", "416")

insert into "运动会" ("举办城市id", "运动会类型", "届数", "年份", "参赛运动员数量", "项目数量", "金牌数量", "奖牌数量") values ("item_geography.2_13_121", "亚洲青年运动会", "3", "2021", "11430", "13", "199", "104")

insert into "运动会" ("举办城市id", "运动会类型", "届数", "年份", "参赛运动员数量", "项目数量", "金牌数量", "奖牌数量") values ("item_geography.2_13_121", "亚运会", "3", "1996", "453", "8", "15", "37")

insert into "运动会" ("举办城市id", "运动会类型", "届数", "年份", "参赛运动员数量", "项目数量", "金牌数量", "奖牌数量") values ("item_geography.2_13_124", "亚运会", "6", "2007", "796", "10", "19", "61")

insert into "运动会" ("举办城市id", "运动会类型", "届数", "年份", "参赛运动员数量", "项目数量", "金牌数量", "奖牌数量") values ("item_geography.2_13_124", "亚洲青年运动会", "2", "2013", "2400", "16", "46", "93")

